In [1]:
import numpy as np
import pandas as pd

In [2]:
columns = ['W', 'X', 'Y', 'Z']

In [3]:
index = ['A', 'B', 'C', 'D', 'E']

In [4]:
from numpy.random import randint

In [7]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [8]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [9]:
df = pd.DataFrame(data,index,columns)

In [10]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [11]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [14]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [16]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [21]:
df['B'] = df['W'] +df['Y']

In [22]:
df

    W   X   Y   Z  new    B
A   2  79  -6 -86   -6   -4
B   6 -29  94 -80   94  100
C   2  21 -24 -13  -24  -22
D  16  -1  19  51   19   35
E  30  49 -18 -99  -18   12

In [24]:
df.drop('new',axis=1)

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [25]:
df

    W   X   Y   Z  new    B
A   2  79  -6 -86   -6   -4
B   6 -29  94 -80   94  100
C   2  21 -24 -13  -24  -22
D  16  -1  19  51   19   35
E  30  49 -18 -99  -18   12

In [26]:
df = df.drop('new',axis=1)

In [27]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [28]:
df.loc['A']

W     2
X    79
Y    -6
Z   -86
B    -4
Name: A, dtype: int32

In [29]:
df.loc[['A','E']]

    W   X   Y   Z   B
A   2  79  -6 -86  -4
E  30  49 -18 -99  12

In [30]:
df.iloc[0]

W     2
X    79
Y    -6
Z   -86
B    -4
Name: A, dtype: int32

In [31]:
df.drop('C')

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [32]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [33]:
df.loc['A', 'W']

2

In [34]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -6
C  2 -24